<?php
/**
 * Created by PhpStorm.
 * User: veoc
 * Date: 8/07/16
 * Time: 10:50 AM
 */

namespace App\Services;

class ChineseFaker
{
    static private $surnames = "李,王,张,刘,陈,杨,黄,赵,周,吴,徐,孙,朱,马,胡,郭,林,何,高,梁,郑,罗,宋,谢,唐,韩,曹,许,邓,萧,冯,曾,程,蔡,彭,潘,袁,于,董,余,苏,叶,吕,魏,蒋,田,杜,丁,沈,姜,范,江,傅,钟,卢,汪,戴,崔,任,陆,廖,姚,方,金,邱,夏,谭,韦,贾,邹,石,熊,孟,秦,阎,薛,侯,雷,白,龙,段,郝,孔,邵,史,毛,常,万,顾,赖,武,康,贺,严,尹,钱,施,牛,洪,龚,汤,陶,黎,温,莫,易,樊,乔,文,安,殷,颜,庄,章,鲁,倪,庞,邢,俞,翟,蓝,聂,齐,向,申,葛,岳";
    static private $givennames = "的,一,是,在,不,了,有,和,人,这,中,大,为,上,个,国,我,以,要,他,时,来,用,们,生,到,作,地,于,出,就,分,对,成,会,可,主,发,年,动,同,工,也,能,下,过,子,说,产,种,面,而,方,后,多,定,行,学,法,所,民,得,经,十,三,之,进,着,等,部,度,家,电,力,里,如,水,化,高,自,二,理,起,小,物,现,实,加,量,都,两,体,制,机,当,使,点,从,业,本,去,把,性,好,应,开,它,合,还,因,由,其,些,然,前,外,天,政,四,日,那,社,义,事,平,形,相,全,表,间,样,与,关,各,重,新,线,内,数,正,心,反,你,明,看,原,又,么,利,比,或,但,质,气,第,向,道,命,此,变,条,只,没,结,解,问,意,建,月,公,无,系,军,很,情,者,最,立,代,想,已,通,并,提,直,题,党,程,展,五,果,料,象,员,革,位,入,常,文,总,次,品,式,活,设,及,管,特,件,长,求,老,头,基,资,边,流,路,级,少,图,山,统,接,知,较,将,组,见,计,别,她,手,角,期,根,论,运,农,指,几,九,区,强,放,决,西,被,干,做,必,战,先,回,则,任,取,据,处,队,南,给,色,光,门,即,保,治,北,造,百,规,热,领,七,海,口,东,导,器,压,志,世,金,增,争,济,阶,油,思,术,极,交,受,联,什,认,六,共,权,收,证,改,清,己,美,再,采,转,更,单,风,切,打,白,教,速,花,带,安,场,身,车,例,真,务,具,万,每,目,至,达,走,积,示,议,声,报,斗,完,类,八,离,华,名,确,才,科,张,信,马,节,话,米,整,空,元,况,今,集,温,传,土,许,步,群,广,石,记,需,段,研,界,拉,林,律,叫,且,究,观,越,织,装,影,算,低,持,音,众,书,布,复,容,儿,须,际,商,非,验,连,断,深,难,近,矿,千,周,委,素,技,备,半,办,青,省,列,习,响,约,支,般,史,感,劳,便,团,往,酸,历,市,克,何,除,消,构,府,称,太,准,精,值,号,率,族,维,划,选,标,写,存,候,毛,亲,快,效,斯,院,查,江,型,眼,王,按,格,养,易,置,派,层,片,始,却,专,状,育,厂,京,识,适,属,圆,包,火,住,调,满,县,局,照,参,红,细,引,听,该,铁,价,严";
    static private $words = "的,是,在,一,不,有,这,个,上,也,他,人,就,对,说,我,要,到,大,我们,多,把,来,等,年,两,从,而,能,又,他们,频序号,词语,以,时,没有,会,之,但,三,被,很,下,自己,后,中国,并,使,向,已,出,用,新,所,里,给,她,更,次,最,于,可以,可,去,频序号,词语,由,问题,小,工作,让,其,你,这个,生活,起,这样,天,它,高,做,家,已经,再,或,才,前,走,这些,一些,却,二,条,位,起来,各,成,频序号,词语,什么,元,现在,社会,比,同,四,关系,名,想,如,第一,因为,该,开始,许多,内,时间,人们,今天,国家,本,点,思想,至,此,一定,如果,副,无,张,同时,需要,月,则,频序号,词语,重要,为了,日,老,就是,作,五,人民,事,认为,成为,像,北京,历史,水,方面,情况,而且,党,学生,每,这里,但是,孩子,可能,发生,必须,只有,外,要求,全,发现,进行,特别,因,频序号,词语,岁,得到,件,文化,分,便,同志,发展,即,日本,总,因此,对于,领导,带,既,时候,钱,自,政府,吃,非,决定,进,还是,受,国,应该,近,美,政治,话,公司,干部,出现,频序号,词语,开,一切,研究,认识,写,十分,十,站,之间,问,希望,快,虽然,相,美国,知道,讲,大家,学校,组织,见,由于,正在,法,表示,一样,活动,如何,教育,书,据,城市,道,艺术,频序号,词语,经济,以及,部,影响,太,其中,学,先生,完全,连,主要,继续,头,革命,之后,参加,能够,住,上海,经过,非常,低,甚至,听,先,一直,学习,仍,办,所以,代表,变,最后,一起,万,频序号,词语,所有,那么,心,越,较,办法,路,有些,未,通过,找,按,拿,解决,一般,另,经,半,强,或者,时代,手,作品,不断,以后,关于,青年,各种,真,其他,农民,那些,余,段,有的,频序号,词语,买,根本,县,作者,者,请,叫,感到,怎么,任何,六,表现,反,存在,然而,准备,送,约,比较,书记,爱,单位,群众,应当,王,早,女,门,个人,座,全国,意义,花,条件,环境,频序号,词语,了解,搞,力量,不仅,目前,经验,产生,真正,回,队,有关,字,会议,生命,今年,努力,靠,八,市,类,共,意见,死,民族,块,只要,文学,成功,变化,句,管,你们,指,地区,方,词语,和,项,注意,当然,达,面,坐,家庭,原因,进入,病,介绍,下来,事情,方式,首,计划,人类,报告,世纪,方法,入,信,化,步,生,声,图,电话,能力,片,作用,台,如此";
    
    static public function name()
    {
        return self::surName() . self::givenName();
    }

    static public function surName()
    {
        return collect(explode(',', self::$surnames))->random();
    }

    static public function givenName()
    {
        $names = collect(explode(',', self::$givennames));
        $name = $names->random();
        if (mt_rand(1,10) > 5) {
            $name .= $names->random();
        }

        return $name;
    }

    static public function text()
    {
        $words = collect(explode(',', self::$words));
        $description = "";
        $numberOfSentences = mt_rand(2,4);
        for ($i = 0; $i < $numberOfSentences; $i++) {
            $sentence = "";
            $numberOfSegments = mt_rand(2,4);
            for ($j = 0; $j < $numberOfSegments; $j++) {
                $numberOfWords = mt_rand(3,5);
                $sentence .= implode($words->random($numberOfWords)->toArray()) . "，";
            }
            $description .= rtrim($sentence,'，') . "。";
        }
        return $description;
    }
}